app/views/orders/_cart.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 3]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 3]]
---
    <%= f.submit "Uppdatera varukorgen", class: "button" %>
    <% if order.order_items.count > 7 %>