app/controllers/giftcards_controller.rb

  def foretag
    @giftcards = Giftcard.where(:in_which_store => 'foretag')
---
SELECT "giftcards".* FROM "giftcards" WHERE "giftcards"."in_which_store" = $1  [["in_which_store", "foretag"]]