app/controllers/order_items_controller.rb

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."order_id" = $2 AND "order_items"."product" = $3 AND "order_items"."subtype" = $4 AND "order_items"."quantity" = $5 LIMIT 1  [["order_id", 1], ["order_id", 1], ["product", "DigitalCard"], ["subtype", "regular"], ["quantity", 200]]
UPDATE "order_items" SET "product_quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["product_quantity", 2], ["updated_at", "2018-09-09 11:23:48.304983"], ["id", 15]]
INSERT INTO "order_items" ("order_id", "product_quantity", "product", "quantity", "subtype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    current_item = @order.order_items.find_by(
      order_id: params[:order_item][:order_id],
      product: params[:order_item][:product],
      subtype: params[:order_item][:subtype],
      quantity: params[:order_item][:quantity]
    )

    if current_item
      current_item.product_quantity += params[:order_item][:product_quantity].to_i
      current_item.save
    else
      @order.order_items.create(order_item_params)

DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 1]]
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT 1  [["order_id", 1], ["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    @order.order_items.find(params[:id]).destroy