app/controllers/orders_controller.rb

  def new
    @donor = @order.donor ? @order.donor : @order.build_donor
    # Get Giftcards for companies only (= 'foretag'):
    #@giftcards = Giftcard.where("in_which_store = 'foretag'")
    @giftcards = Giftcard.all
---
SELECT "giftcards".* FROM "giftcards" WHERE (in_which_store = 'foretag')

  def update
    @order.update(order_params)

    order_items_with_zero_product_quantity = @order.order_items.find_by(product_quantity: 0)
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."product_quantity" = $2 LIMIT 1  [["order_id", 1], ["product_quantity", 0]]